app/controllers/images_controller.rb

INSERT INTO "active_storage_blobs" ("key", "filename", "content_type", "metadata", "service_name", "byte_size", "checksum", "created_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
        )
      end

    blob = ActiveStorage::Blob.create_and_upload!(
      io: io, filename: "resultado.png", content_type: "image/png"
    )